import java.util.*;



public class Form_Groupify {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        System.out.println("AM");
        String AM = scanner.nextLine();

    }
}

2. ΠΟΣΟ θα βαθμολογούσες τις επικοινωνιακές σου ικανότητες με τους συναδέλφους σου σε θέματα προσέγγισης της εργασίας
    1 = Απουσία επικοινωνιακής ικανότητας
    3 = Μέτρια επικοινωνιακή ικανότητα
    5 = Άριστη επικοινωνιακή ικανότητα

3. Ποια είναι τα βασικα χαρακτηριστικά της προσωπικότητας σου που θα σε βοηθήσουν για την ομαδική εργασία ;
    1. Ομαδικότητα
    2. Συνέπεια
    3. Ηγετική Ικανότητα
    4. Οργάνωση
    5. Διάθεση για ενασχόληση//Αν αυτή η ερώτηση δεν πιάνεται ως έγκυρη τότε θα βάλουμε ξεχωριστές ερωτησεις με αυτοβαθμολόγηση του ερωτούμενου
    //σχετικά με το κάθε χαρακτηριστικό (πχ: βαθμολόγησε απο 1-5 την ομαδικότητα σου)

4. Κατά ΠΟΣΟ θα βαθμολογούσες το ενδιαφέρον σου για το μάθημα και το αντικείμενο του εν λόγω μαθήματος/εργασίας (πχ 1 έως 5)

    1=Το θεμα της εργασίας και το αντικείμενο του μαθήματος δεν με ενδιαφέρουν
    2=Το μάθημα μου είναι αδιάφορο
    3=Το θεμα μου είναι αδιάφορο ωστοσο έχω τη διάθεση να εντρυφήσω στο αντικείμενο
    4=Το μάθημα με αφορά
    5=Το μάθημα με αφορά πλήρως και αποτελεί ένα από τα αντικείμενα τα οποία θα ήθελα να ακολουθήσω στο μέλλον

5. Πως βαθμολογείτε τις γνώσεις σας με βάση το μάθημα και βαθμούς που έχετε λάβει σε αντίστοιχα μαθήματα ;
    1 = Κάτω από την βάση - δεν έχω παρακολουθήσει αντίστοιχα μαθήματα
    3 = Βαθμολογία Βάσης
    5 = Βαθμολογία >8 στα περισσότερα μαθήματα και ικανοποιητικό επίπεδο γνώσης του αντικείμενου

6. Πως βαθμολογείτε τον εαυτό σας σε όρους συνέπειας, με βάση την συμμετοχή σας σε προηγούμενες ομάδες εργασίας ;
    1 = Καθόλου Συνεπής
    5 = Απολύτως Συνεπής

7. Πως βαθμολογείτε τον εαυτό σας σε όρους διαχείρισης χρόνου με βάση τον χρόνο παράδοσης σας σε προηγούμενες εργασίες ;
    1 = Κακή διαχείριση χρόνου - Παράδοση εκπρόθεσμα
    3 = Μέτρια διαχείριση χρόνου - Παράδοση αμέσως πριν τη λήξη της προθεσμίας
    5 = Άριστη διαχείριση χρόνου - Παράδοση εργασιών πολύ πριν την τελική ημερομηνία παράδοσης

8. 5. Γενικά είστε ικανοποιημένος με την απόδοσή σας ;
    1 = Καθόλου Ικανοποιημένος
    2 = Σχεδόν Ποτέ
    3 = Ουδέτερος
    4 = Σχετικά ικανοποιημένος
    5 = Απολύτως ικανοποιημένος

9. Παρακολουθείτε και αν ναι πόσο συχνά τις διαλέξεις του μαθήματος ;
    1 = Δεν παρακολουθώ Ποτέ
    2 = Παρακολουθώ Σπάνια
    3 = Παρακολουθώ Μερικές Φορές
    4 = Παρακολουθώ Συχνά
    5 = Παρακολουθώ Πάντα
