import java.util.*;

public class Form_Groupify {
    public static void main(String[] args) {
        Scanner myObj = new Scanner(System.in);
        System.out.println("Παρακαλώ συμπληρώστε το παρακάτω ερωτηματολόγιο κλίμακας αριθμών 1-5 με βάση το βαθμό συμφωνίας/ταύτισης σας");
        System.out.println("AM");
        String AM = myObj.nextLine();

        System.out.println("Όνομα");
        String name = myObj.nextLine();

        System.out.println("Επώνυμο");
        String surname = myObj.nextLine();

        System.out.println("E-mail");
        String email = myObj.nextLine();

        System.out.println("Κωδικός Μαθήματος");
        int code = myObj.nextInt();

        //Εδω αρχίζουν οι ερωτήσεις χαρακτήρα
        System.out.println("1. Μπορώ να προσαρμοστώ εύκολα σε διαφορετικούς ρόλους μέσα στην ομάδα");
        int q1 = myObj.nextInt();
        System.out.println("2. Είμαι ανοιχτός/η στο να δεχτώ κριτική από τα μέλη της ομάδας μου");
        int q2 = myObj.nextInt();
        System.out.println("3. Βάζω το ομαδικό συμφέρον πάνω από το προσωπικό");
        int q3 = myObj.nextInt();
        System.out.println("4. Επικεντρώνομαι στο να βρίσκω ψύχραιμα λύσεις όταν προκύπτουν προβλήματα στην ομάδα ");
        int q4 = myObj.nextInt();
        System.out.println("5. Είμαι πρόθυμος να βοηθήσω με τις γνώσεις και τις δεξιότητες μου, μέλη της ομάδας στο δικό τους κομμάτι");
        int q5 = myObj.nextInt();
        System.out.println("6. Ενθαρρύνω την πολυφωνία και την ανταλλαγή διαφορετικών ιδεών στην ομάδα");
        int q6 = myObj.nextInt();
        System.out.println("7. Νιώθω άνετα να εκφράσω τη διαφωνία μου όταν είναι απαραίτητο");
        int q7 = myObj.nextInt();
        System.out.println("8. Προσαρμόζομαι εύκολα σε αλλαγές στα σχέδια που μπορεί να προκύψουν κατά τη διάρκεια της εργασίας");
        int q8 = myObj.nextInt();
        System.out.println("9. Πόσα από τα παρακάτω χαρακτηριστικά προσωπικότητας θεωρείτε ότι διαθέτετε: ομαδικότητα, συνέπεια, ηγετική ικανότητα, οργάνωση, διάθεση για ενασχόληση");
        System.out.println("1 = 1, 2 = 2, 3 = 3, 4 = 4, 5 = 5");
        int q9 = myObj.nextInt();
        System.out.println("10. Γενικά είστε ικανοποιημένος/η με την απόδοσή σας ;" +
         "1 = Καθόλου Ικανοποιημένος/η, 2 = Σχεδόν Ποτέ, 3 = Ουδέτερος/η, 4 = Σχετικά ικανοποιημένος/η, 5 = Απολύτως ικανοποιημένος/η");
         int q10 = myObj.nextInt();
         //Εδώ αρχίζουν οι πρακτικές ερωτήσεις
        System.out.println("11. Συμμετέχω ενεργά στη λήψη αποφάσεων της ομάδας.");
        int q11 = myObj.nextInt();
        System.out.println("12. Ξέρω να χρησιμοποιώ ψηφιακά εργαλεία συνεργασίας (πχ. git, GitHub κλπ.)");
        int q12 = myObj.nextInt();
        System.out.println("13. Ακολουθώ το χρονοδιάγραμμα που έχει θέσει η ομάδα.");
        int q13 = myObj.nextInt();
        System.out.println("14. Συμμετέχω ενεργά στις συναντήσεις και στις συνομιλίες της ομάδας.");
        int q14 = myObj.nextInt();
        System.out.println("15. Πόσο θα βαθμολογούσατε τις επικοινωνιακές σας ικανότητες με διάφορους τύπους συναδέλφων σε θέματα προσέγγισης της εργασίας;" +
         "1 = Απουσία επικοινωνιακής ικανότητας, 3 = Μέτρια επικοινωνιακή ικανότητα, 5 = Άριστη επικοινωνιακή ικανότητα)");
         int q15 = myObj.nextInt();
        System.out.println("16. Κατά πόσο θα βαθμολογούσατε το ενδιαφέρον σας για το θέμα της εργασίας και το αντικείμενο του εν λόγω μαθήματος;" + 
        "1 = Το θέμα της εργασίας και το αντικείμενο του μαθήματος μου είναι αδιάφορα, 2 = Το θέμα της εργασίας μου είναι αδιάφορο αλλά το μάθημα με ενδιαφέρει, 3 = Το θέμα μου είναι αδιάφορο ωστόσο έχω τη διάθεση να εντριφήσω στο αντικείμενο, 4 = Το μάθημα με αφορά, 5 = Το μάθημα με αφορά πλήρως και αποτελεί ένα από τα αντικείμενα που θα ήθελα να ακολουθήσω στο μέλλον");
        int q16 = myObj.nextInt();
        System.out.println("17. Παρακολουθείτε και αν ναι πόσο συχνά τις διαλέξεις του μαθήματος;" +
        "1 = Ποτέ, 3 = Μερικές φορές, 5 = Πάντα");
        int q17 = myObj.nextInt();
        System.out.println("18. Πώς βαθμολογείτε τις γνώσεις σας με βάση το μάθημα και τους βαθμούς που έχετε λάβει σε αντίστοιχα μαθήματα;" + 
        "1 = Κάτω από τη βάση-δεν έχω παρακολουθήσει αντίστοιχα μαθήματα, 3 = Βαθμολογία βάσης, 5 = Βαθμολογία >8 στα περισσότερα μαθήματα και ικανοποιητικό επίπεδο γνώσης αντικειμένου");
        int q18 = myObj.nextInt();
        System.out.println("19. Πώς βαθμολογείτε τον εαυτό σας σε όρους διαχείρισης χρόνου, με βάση τον χρόνο παράδοσής σας σε προηγούμενες εργασίες;" +
        "1 = Κακή διαχείριση χρόνου-Παράδοση εκπρόθεσμα, 3 = Μέτρια διαχείριση χρόνου-Παράδοση αμέσως πριν τη λήξη της προθεσμίας, 5 = Άριστη διαχείριση χρόνου-Παράδοση εργασιών πολύ πριν την τελική ημερομηνία παράδοσης)");
        int q19 = myObj.nextInt();
        System.out.println("20. Πώς βαθμολογείτε τον εαυτό σας σε όρους συνέπειας χρόνου, με βάση τη συμμετοχή σας σε προηγούμενες εργασίες;" +
        "1 = Καθόλου συνεπής, 5 = Απολύτως συνεπής");
        int q20 = myObj.nextInt();
    }
}

